src/InformationRegisters/ОбъектыОпераций/ОбъектыОпераций.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОбъектыОпераций</name>
  <resources>
    <name>СуммаПоступления</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаСписания</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>14</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <dimensions>
    <name>Дата</name>
    <type>
      <types>Date</types>
    </type>
  </dimensions>
  <dimensions>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ПредметУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Операция</name>
    <type>
      <types>DocumentRef</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ТипПоказателя</name>
    <type>
      <types>EnumRef.ТипыБюджетныхПоказателей</types>
    </type>
  </dimensions>
  <dimensions>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/InformationRegisters/ПараметрыГрафикаПогашенияДолгов/ПараметрыГрафикаПогашенияДолгов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ПараметрыГрафикаПогашенияДолгов</name>
  <resources>
    <name>ДатаВозникновенияДолга</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаДолга</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПроцентнаяСтавка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕдиноразовойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаЕжемесячнойКомиссии</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СпособПогашения</name>
    <type>
      <types>EnumRef.СпособыПогашенияКредита</types>
    </type>
  </resources>
  <resources>
    <name>СрокМесяцев</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ПлановаяДатаПогашения</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДнейВГоду</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>3</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДеньМесяцаДляРасчетов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>ДатаЗакрытияДолга</name>
    <comment>С этой даты отменяются все плановые операции</comment>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </resources>
  <resources>
    <name>НеПересчитыватьПриРедактировании</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ШаблонОперации</name>
    <type>
      <types>DocumentRef.МыВернулиДолг</types>
      <types>DocumentRef.НамВернулиДолг</types>
      <types>DocumentRef.УниверсальнаяОперация</types>
    </type>
  </resources>
  <resources>
    <name>КошелекДляПогашения</name>
    <type>
      <types>CatalogRef.КошелькиИСчета</types>
    </type>
  </resources>
  <resources>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяДляУчетаПроцентов</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕдиноразовойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <resources>
    <name>СтатьяЕжемесячнойКомиссии</name>
    <type>
      <types>CatalogRef.СтатьиРасходов</types>
      <types>CatalogRef.СтатьиДоходов</types>
    </type>
  </resources>
  <dimensions>
    <name>Долг</name>
    <type>
      <types>CatalogRef.Долги</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

src/Documents/ВводИзменениеОстатка/ВводИзменениеОстатка.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>ВводИзменениеОстатка</name>
  <registerRecords>AccountingRegister.ЖурналОпераций</registerRecords>
  <registerRecords>AccumulationRegister.ФактическиеОборотыБюджета</registerRecords>
  <attributes>
    <name>ВалютаОперации</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>ОбъектУчета</name>
    <type>
      <types>Characteristic.ВидыСубконто</types>
    </type>
  </attributes>
  <attributes>
    <name>ОписаниеОперации</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>РазделУчета</name>
    <type>
      <types>ChartOfAccountsRef.РазделыУчета</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстатка</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПредставлениеНовогоОстаткаПроцентов</name>
    <comment>(Инф.)</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>300</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДохода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстатка</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаНовогоОстаткаПроцентов</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаРасхода</name>
    <comment>(Инф.)</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ФинансоваяЦель</name>
    <type>
      <types>CatalogRef.ФинансовыеЦели</types>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоШаблон</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Document>

src/CommonModules/ОбслуживаниеДокументов/Module.bsl
////////////////////////////////////////////////////////////////////////////////
// ОбслуживаниеДокументов: 
//	* Обработка событий объектов документов
//	* Общий функционал, используемый в модулях объектов и менеджеров документов
//	* Функции подготовки движений документов
//  
////////////////////////////////////////////////////////////////////////////////

#Область ПрограммныйИнтерфейс

////////////////////////////////////////////////////////////////////////////////
//	* обработка событий объектов документов

// Обработка подписки на событие ЗаписьОбъектовОпераций
Процедура ЗаписьОбъектовОпераций(Источник, Отказ) Экспорт
	
	Если Отказ Или Источник.ОбменДанными.Загрузка 
		Или Не Источник.ДополнительныеСвойства.Свойство("ТаблицыДокумента")
		Или Не Источник.ДополнительныеСвойства.ТаблицыДокумента.Свойство("ОбъектыОперации") Тогда
		Возврат;
	КонецЕсли;
	
	НаборЗаписей = РегистрыСведений.ОбъектыОпераций.СоздатьНаборЗаписей();
	НаборЗаписей.Отбор.Операция.Установить(Источник.Ссылка);
	НаборЗаписей.Загрузить(Источник.ДополнительныеСвойства.ТаблицыДокумента.ОбъектыОперации);
	НаборЗаписей.Записать(Истина);
	
КонецПроцедуры

// Обработка подписки на событие ПередУдалениемДокумента
Процедура ПередУдалениемДокумента(Источник, Отказ) Экспорт

	Если Не Отказ Тогда
		ПлановыеОперации.ПередУдалениемПлановойОперации(Источник, Отказ);
	КонецЕсли;
	
	Если Не Отказ Тогда
		РегистрыСведений.ПараметрыГрафикаПогашенияДолгов.ПередУдалениемШаблонаОперации(Источник.Ссылка, Отказ);
	КонецЕсли;
	
КонецПроцедуры

// Обработка подписки на событие ЗаписьШаблоновИПлановыхОперацийПриЗаписи
Процедура ЗаписьШаблоновИПлановыхОперацийПриЗаписи(Источник, Отказ) Экспорт
	
	
	Если Отказ Или Источник.ОбменДанными.Загрузка 
		Или Не Источник.ДополнительныеСвойства.Свойство("ТаблицыДокумента") Тогда
		Возврат;
	КонецЕсли;
	
	
	Если Источник.ЭтоШаблон Тогда
		
		// формируем плановые движения по шаблону операций
		ПлановыеОперации.СформироватьОборотыШаблонаДокументов(Источник.Ссылка, Источник.ДополнительныеСвойства);
		
	ИначеЕсли Источник.ДополнительныеСвойства.Свойство("ЭтоПлановаяОперация") И Источник.ДополнительныеСвойства.ЭтоПлановаяОперация 
			И Источник.ДополнительныеСвойства.Свойство("ШаблонОперации") И ЗначениеЗаполнено(Источник.ДополнительныеСвойства.ШаблонОперации)
			Тогда
			
		// Непроведенная плановая операция является исключением (содержит суммы, отличные от сумм шаблона)
		// для учета ее сумм нужно переформировать обороты по шаблону
		Если Источник.Проведен Тогда 
			
			Если Источник.ДополнительныеСвойства.ШаблонОперации = Источник.Ссылка Тогда
				// Операция запланирована без шаблона. Считываем плановые обороты, записанные до проведения
				Источник.Движения.ОборотыПлановыхОпераций.Прочитать();
				Источник.ДополнительныеСвойства.Вставить("ПлановыеДвиженияОперации", Источник.Движения.ОборотыПлановыхОпераций.Выгрузить());
			КонецЕсли;
			
		Иначе
			
			// формируем новые движения по плановой операции
			ПлановыеОперации.СформироватьОборотыШаблонаДокументов(Источник.ДополнительныеСвойства.ШаблонОперации,  Неопределено);
			
		КонецЕсли;
		
		
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
//	* Общий функционал, используемый в модулях объектов и менеджеров документов

// Возвращает дату с учетом настроек пользователя: либо текущую дату/время, либо дату последней записанной операции
//
//Параметры:
//	<нет>
//
Функция ДатаНовогоДокумента() Экспорт

	Результат = ТекущаяДатаСеанса();
	
	ТипДатыНовойОперации   = ПользовательскиеНастройкиДеньгиСервер.ТипДатыНовойОперации();
	Если ТипДатыНовойОперации = "ИзПоследнейОперации" И ЗначениеЗаполнено(ПараметрыСеанса.ДатаПоследнейОперации) Тогда
		
		Результат = НачалоДня(ПараметрыСеанса.ДатаПоследнейОперации) + (Результат - НачалоДня(Результат))
		
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Проверяет основные реквизиты документа, при необходимости заполняет их в соответствии с настройками пользователя
// Вызывается из обработчика ОбработкаЗаполнения модулей объекта документов
//
//Параметры
//	ДокументОбъект - заполняемый документ
//	ЭтоКопия - Булево - признак того, что документ заполнен копированием
//
Процедура ПроверитьЗаполнениеНовогоДокумента(ДокументОбъект, ЭтоКопия = Ложь) Экспорт
	
	Если (ЭтоКопия Или Не ЗначениеЗаполнено(ДокументОбъект.Дата)) И Не ДокументОбъект.ЭтоШаблон Тогда
		ДокументОбъект.Дата = ОбслуживаниеДокументов.ДатаНовогоДокумента();
	КонецЕсли;
	
	Если ЭтоКопия Или Не ЗначениеЗаполнено(ДокументОбъект.Пользователь) Тогда
		ДокументОбъект.Пользователь = Пользователи.ТекущийПользователь();
	КонецЕсли;
	
КонецПроцедуры


////////////////////////////////////////////////////////////////////////////////
//	* Функции подготовки движений документов

Процедура ОбщаяПроверкаДополнительныхСвойствДокумента(Операция, ДополнительныеСвойства) Экспорт
	
	Если ТипЗнч(ДополнительныеСвойства) <> Тип("Структура") Тогда
		ДополнительныеСвойства = Новый Структура;
	КонецЕсли; 
	
	Если НЕ ДополнительныеСвойства.Свойство("ВалютаУчета") ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеСвойства.ВалютаУчета) Тогда
		ДополнительныеСвойства.Вставить("ВалютаУчета", Константы.ВалютаУчета.Получить())
	КонецЕсли;
	
	Если НЕ ДополнительныеСвойства.Свойство("Период") ИЛИ НЕ ЗначениеЗаполнено(ДополнительныеСвойства.Период) Тогда
		ДополнительныеСвойства.Вставить("Период", Операция.Дата)
	КонецЕсли;

	Если Не ДополнительныеСвойства.Свойство("ЭтоПлановаяОперация") И Не Операция.ЭтоШаблон Тогда
		
		// Проверяем, является ли операция шаблоном или плановой операцией
		СвойстваПлановойОперации = ПлановыеОперации.СвойстваПлановойОперации(Операция.Ссылка);
		Для каждого КлючИЗначение Из СвойстваПлановойОперации Цикл
			ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("НеВосстанавливатьПоследовательность") И Не ОбщегоНазначения.ЭтоСсылка(ТипЗнч(Операция)) Тогда
		
		Если Операция.ПринадлежностьПоследовательностям.Найти("ВводИзменениеОстатков") <> Неопределено Тогда
			Операция.ПринадлежностьПоследовательностям.ВводИзменениеОстатков.ДополнительныеСвойства.Вставить(
					"НеВосстанавливатьПоследовательность", ДополнительныеСвойства.НеВосстанавливатьПоследовательность)
		КонецЕсли;
		
	КонецЕсли;
	
КонецПроцедуры

Функция НоваяТаблицаРегистровОборотовБюджета() Экспорт

	Результат = РегистрыНакопления.ФактическиеОборотыБюджета.СоздатьНаборЗаписей();
	Возврат Результат.ВыгрузитьКолонки();

КонецФункции

Функция НоваяТаблицаРегистраОбъектыОпераций() Экспорт

	Результат = РегистрыСведений.ОбъектыОпераций.СоздатьНаборЗаписей();
	Возврат Результат.ВыгрузитьКолонки();

КонецФункции

// Предварительная обработка документа при записи
//
//Параметры:
//	ДокументОбъект - записываемый документ
//
Процедура ПриЗаписиОбъектаДокумента(ДокументОбъект) Экспорт
	
	КлючевыеСвойства = СтруктураКлючевыхДополнительныхСвойствОперации(ДокументОбъект, 
			"ОтложеннаяЗапись,ОтложенноеПроведение,ОтключитьМеханизмРегистрацииОбъектов,ПропуститьПроверкуЗапретаИзменения,СведенияОВерсииОбъекта,
			|НеПроверятьСостояние,НеОбновлятьПорядокВПоказателях,НеВосстанавливатьПоследовательность,УдалятьРегистрацию,УзелКорреспондента");
	
	// Копирование ключевых дополнительных свойтв из Документа в его движения
	Для каждого Набор Из ДокументОбъект.Движения Цикл
		
		Для каждого КлючИЗначение Из КлючевыеСвойства Цикл
			Набор.ДополнительныеСвойства.Вставить(КлючИЗначение.Ключ, КлючИЗначение.Значение);
		КонецЦикла;
		
		Если ДокументОбъект.ОбменДанными.Загрузка И ТипЗнч(Набор) = Тип("РегистрНакопленияНаборЗаписей.ОборотыПлановыхОпераций") Тогда
			Набор.ОбменДанными.Загрузка = Истина;
			Набор.ОбменДанными.Отправитель = ДокументОбъект.ОбменДанными.Отправитель;
		КонецЕсли;
		 
	КонецЦикла;
	
КонецПроцедуры

// Выбирает и перепроводит все операции воода/изменения остатка за указанный период
//
//Параметры:
//	НачалоПериода- Дата - начало периода, с которого нужно выбрать все операции Ввода/изменения остатка
//
Процедура ПерепровестиИзмененияОстатков(НачалоПериода, УзелКорреспондента) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("НачалоПериода", НачалоПериода);
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВводИзменениеОстатка.Ссылка КАК Ссылка
	|ИЗ
	|	Документ.ВводИзменениеОстатка КАК ВводИзменениеОстатка
	|ГДЕ
	|	ВводИзменениеОстатка.Дата >= &НачалоПериода
	|
	|УПОРЯДОЧИТЬ ПО
	|	ВводИзменениеОстатка.Дата,
	|	Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВводИзменениеОстатков.ОбъектУчета КАК ОбъектУчета,
	|	МАКСИМУМ(ВводИзменениеОстатков.Регистратор) КАК Регистратор,
	|	МАКСИМУМ(ВводИзменениеОстатков.Период) КАК Период,
	|	ВводИзменениеОстатков.РазделУчета
	|ИЗ
	|	Последовательность.ВводИзменениеОстатков КАК ВводИзменениеОстатков
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Последовательность.ВводИзменениеОстатков.Границы КАК ВводИзменениеОстатковГраницы
	|		ПО ВводИзменениеОстатков.ОбъектУчета = ВводИзменениеОстатковГраницы.ОбъектУчета
	|			И ВводИзменениеОстатков.РазделУчета = ВводИзменениеОстатковГраницы.РазделУчета
	|			И ВводИзменениеОстатков.МоментВремени > ВводИзменениеОстатковГраницы.МоментВремени
	|			И (ВводИзменениеОстатков.Регистратор.Проведен)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВводИзменениеОстатков.ОбъектУчета,
	|	ВводИзменениеОстатков.РазделУчета
	|
	|УПОРЯДОЧИТЬ ПО
	|	Период";
	
	ПакетРезультатов = Запрос.ВыполнитьПакет();
	Выборка = ПакетРезультатов[0].Выбрать();
	Пока Выборка.Следующий() Цикл
		
		УдалятьРегистрациюИзменений =  ЗначениеЗаполнено(УзелКорреспондента) 
				И Не ПланыОбмена.ИзменениеЗарегистрировано(УзелКорреспондента, Выборка.Ссылка);
		
		ДокументОбъект = Выборка.Ссылка.ПолучитьОбъект();
		
		ДокументОбъект.ДополнительныеСвойства.Вставить("ОтключитьМеханизмРегистрацииОбъектов", Истина);
		ДокументОбъект.ДополнительныеСвойства.Вставить("НеВосстанавливатьПоследовательность",  Истина);
		
		Попытка
			ДокументОбъект.Записать(?(ДокументОбъект.Проведен, РежимЗаписиДокумента.Проведение, РежимЗаписиДокумента.Запись));
		Исключение
			ТекстСообщения = НСтр("ru = 'Не удалость обработать <%1>.
				|Информация для службы поддержки: ""%2""'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ТекстСообщения, ДокументОбъект, ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			Сообщить(ТекстСообщения);
		КонецПопытки; 
		
		//Удаляем регистрацию полученного документа
		Если УдалятьРегистрациюИзменений Тогда
			ПланыОбмена.УдалитьРегистрациюИзменений(УзелКорреспондента, Выборка.Ссылка);
		КонецЕсли; 
		
	КонецЦикла;
	
	// Сдвигаем границу последовательности на последний документ для каждого объекта учета
	Выборка = ПакетРезультатов[1].Выбрать();
	Пока Выборка.Следующий() Цикл
		Последовательности.ВводИзменениеОстатков.УстановитьГраницу(Выборка.Регистратор.МоментВремени(), 
						Новый Структура("ОбъектУчета,РазделУчета", Выборка.ОбъектУчета, Выборка.РазделУчета));
	КонецЦикла;
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Функция СтруктураКлючевыхДополнительныхСвойствОперации(ДокументОбъект, ИменаСвойств) 

	Результат = Новый Структура;
	ИскомыеСвойства = СтрРазделить(ИменаСвойств, ",", Ложь);
	Для каждого ИмяСвойства Из ИскомыеСвойства Цикл
		ЗначениеСвойства = Неопределено;
		Если ДокументОбъект.ДополнительныеСвойства.Свойство(ИмяСвойства, ЗначениеСвойства) Тогда
			Результат.Вставить(ИмяСвойства, ОбщегоНазначенияКлиентСервер.СкопироватьРекурсивно(ЗначениеСвойства));
		КонецЕсли;
	КонецЦикла;
	
	Возврат Результат;

КонецФункции
 
#КонецОбласти
